{"meta":{"title":"Whurthay web analytics","subtitle":null,"description":null,"author":"Ayush Narula","url":"blog.whurthay.com"},"pages":[],"posts":[{"title":"Pricing explained","slug":"Pricing-explained","date":"2018-07-01T11:23:38.000Z","updated":"2018-07-01T12:21:53.000Z","comments":true,"path":"2018/07/01/Pricing-explained/","link":"","permalink":"blog.whurthay.com/2018/07/01/Pricing-explained/","excerpt":"","text":"The pricing plans offerend by the WHURTHAY web analytics platforms, comes in three categories * Chicko Breath Godum Pricing/Plans page * For enterprise pricing, please contact sales directly at sales@whurthay.com Pricing explained:For instance, consider the Breath plan. It has a fee of $51, every month. for access to analytics and tracking of 10000 unique visitors. A lot of people, ask us, if the visitor tracking &amp; analytics would stop after 10000 unique visiors have been tracked for that month, and the answer is NO. Actually, what really happens is that only the latest 10000 users are visible and analysed each month, and this would be true, when you are on the Breath plan. As, the visitor number grows more than 10,000 users. The latest 10000 are kept, and the older which were the visitors at the end of that list of 10000 are hidden from the analysis and the dashboard list, once that happens. Saying that, one can still request to get history of all the visitors to their website, which could be beyond their plan’s limit. This could be important for auditing or to identify someone, who bought from you eons ago. To request any visitor details to your site, beyond your plan limit. Use the contact form under the dashboard account settings, or reach us directly at archived@whurthay.com","categories":[],"tags":[{"name":"pricing","slug":"pricing","permalink":"blog.whurthay.com/tags/pricing/"}]},{"title":"Product Overview","slug":"Product-Overview","date":"2018-06-30T22:53:30.000Z","updated":"2018-07-03T01:57:58.000Z","comments":true,"path":"2018/07/01/Product-Overview/","link":"","permalink":"blog.whurthay.com/2018/07/01/Product-Overview/","excerpt":"","text":"What’s this Whurthay thing? Whurthay web analytics allows its users to tag &amp; identify their website visitors. The purpose is to identify &amp; predict user behaviour on their website, and estimate traction. The tagging feature allows you to identify your most frequent user &amp; potential customers. It also allowsto identify which user segment, a visiting user belong to, and customize site/customer support/productbehaviour accordingly. Accessing the platformTracking your website visitors using the Whurthay web analytics platform starts with the following easy to followsteps: Start registration Get started by either clicking the register button on the landing page or entering your website address, and clicking the Track my site visitors button Register On the registraion page, Fill out all the details, and submit using the register button Registraion page is a bit different, if you’ve already entered the website address at the home page.If the registraion page is something like the one shown above, Fill in the remaining details, and submit using theRegister button You would be requested to confirm your email address. You would be shown this page, once you click the ‘confirm email’ button, in the confirmation email Once you re-login, you have to choose a plan, or go with the default selected Breath plan, Enteryour payment details, once that’s done, you gain access to the platform. Once your payment is successful, you are shown instructions on how to start tracking your website visitors,using the unique code, generated for your particular website. Once the tracking code is installed properly, the tracking data gets collected and displayed on your sitedashboard The Dashboard The Dashboard would be the entrance to your whurthay web analytics platform, after signing in. It is customized for each user, based on their plan and the site it tracks. The dashboard, shows minute details of every visitor to your site. The time/day of visit. If they are areturning visitor, Which part of the world, do they belong to, Their browser preferences, If they are browsingon a mobile, tablet or from a pc, their browser and system brands, Operating system etc… Once this data is aggregated, you get access to the analytics section which could be accessed using the☰ hamburger icon, in the top left corner of the dashboard. Analytics Don’t estimate dips and highs in your web traffic anymore. As, analytics at Whurthay allows you to, access detailed view of your current &amp; predicted web traffic trends.Highs &amp; lows in visitor trends is depicted, analysed &amp; predicted, based on visitors frequency of your website. Usage by device: if the user is accessing your website, using a dektop, mobile or a tablet is segmented as pies, for the user to access and analyse Usage by Browser: The browser used by the website users, is grouped, stored and mapped as pies, for the website users to access and analyse The countries where your webapp is most and least popular, gives you a detailed insight into, your target market, and the cultures and people that are more focused and excited to use your product, shows areas you can put more focus into, and give insights into markets, that still needs to be captured. This would help make businesses more diverse in the long run. A world map is used to highlight countries and parts of the world, where your application is the most popular. Gives insights into, people and cultures, which find your application, the most appealing. Operating system popularity, among your website users, gives understanding your user choices, and speding habits. As according to statistics, mac users are said to prefer quality, and are willing to pay a higher price, for better user experience. Thus, if your user’s are mostly using a mac, you know, you need to focus more on quality and user experience, and in turn are allowed to, and can A/B test to charge a higher price, for a higher quality product. A sun burst chart is also generated for easily visualizing and accessing operating system usage and preferences by your website users. The moment you assign different tags to your visitors, using the dashboard add a tag feature, It also generates a tag group scatter plot, under the analytics section, grouping users based on the tag, they are assigned on the dashboard. This gives an in-depth view of the group of visitors that belong to different segments, based on their usage and frequency habits of your website product. Users are also segmented as new, returning or old customers. This allows us to comprehend user interest, as more returning customer, means higher interest group user, which in turn means, better content or landing page of the tracked website. But, higher numbers could eventually be targeted, based on these numbers. This would result in imporving one’s website, for higher returning and new visitors/potential/customers to website Explaining visitor data Visitors are segemented based on, if it a spider bot that is visiting, or a realy actual human.Other segments are based on device/brand info, machine info, browser usage statistics, and if a user is new, old or returning visitor.","categories":[],"tags":[{"name":"product","slug":"product","permalink":"blog.whurthay.com/tags/product/"}]},{"title":"System and device information","slug":"System-and-device-information","date":"2018-06-12T07:55:06.000Z","updated":"2018-06-12T08:08:31.000Z","comments":true,"path":"2018/06/12/System-and-device-information/","link":"","permalink":"blog.whurthay.com/2018/06/12/System-and-device-information/","excerpt":"","text":"Software and Hardware tracking of site visitors! We launched another update yesterday, where our users could also get live updates on the machine that their site visitors are using.This is a powerful detail, as this allows them to know, the software and hardware of their site visitors. While, web and mobile appsusally run independent of the system on which they are used. Still, it is statistical to get to know the software andhardware preferences of your customers. Like if you know your users are mostly on android or windows. Then, you could locate your targetniche with more ease now. As, everybody knows wars between segments of people using Android vs ios users and windows vs Mac users vs Linux users. More linux users, mean you are really targeting the open source community, and more Mac users, you are targeting the market, with morebuying power. Every little piece of information that you have about your customer is as powerful than anything, about getting to know them. It’s likewhen you meet somebody for the first time. The more you know about them, even if it’s just about their favourite football team. You knowwhere to categorize them. It’s that simple Hope you guys are enjoying whurthay as much as we love making and growing this.","categories":[],"tags":[]},{"title":"Powerful tagging and browser device details","slug":"Powerful-tagging-and-browser-device-details","date":"2018-06-10T02:19:42.000Z","updated":"2018-06-10T02:40:27.000Z","comments":true,"path":"2018/06/10/Powerful-tagging-and-browser-device-details/","link":"","permalink":"blog.whurthay.com/2018/06/10/Powerful-tagging-and-browser-device-details/","excerpt":"","text":"We recently introduced a tagging your visitor feature. This would allow our present &amp; future customers to tag their visitors, while they are tracking their visits. This results in website owners/our customers to powerfully identify their visitors, with utmost ease. This is a powerful rollout, and we identify it as a game changer. This also separates us from other website tracking softwares, as this feature is one of its kind. Please review our provacy policy, to confirm, how we use this information. We also included end users browser and device information. This means that our customers can now identify, the device and the browser with which their customers are visiting their site. This not only enables them to test their site with browsers from which there are the most frequent visits to their site, but also to develop different version of their sites for mobile and tablet, or easily make their current site responsive, if they have a huge chunk of traffic, visiting their site from mobile. Easy peasy. Have any questions, shoot an email to Katy Our pricing is pretty standard as well now, understanding the plethora of quality information our customers get from our site. Peace","categories":[],"tags":[]},{"title":"New markers and trends graph","slug":"New-markers-and-trends-graph","date":"2018-06-07T06:34:30.000Z","updated":"2018-06-10T02:40:30.000Z","comments":true,"path":"2018/06/07/New-markers-and-trends-graph/","link":"","permalink":"blog.whurthay.com/2018/06/07/New-markers-and-trends-graph/","excerpt":"","text":"We recently revamped the design on whurthay! We recently deployed starred map markers that differentiates between new and returning website visitors. The design and icon for the markers were changed as well, to accomodate a clean user icon, representing a person, accessing your website. We made our user visits graph prettier as well, now distinguishing between users based on the continent to which they belong to. The UI is of flat design, to allow to move the browser into full screen mode. We know, you’d need a hit count browser on a giant screen of your office space, and you also need to celeberate important visitor/customer number milestones. We feel you, fellow whurthaiet. What’s next Our team is working on rolling on more features in a few days, like browser, device detection. You’d finally get to know, the tiniest details of your user’s system. Like, their operating system, their brower type, version and even their laptop/phone/table model. For example, a detailed review of your visitor’s device details would be if they visited your site using a Huawei laptop, running a Cent OS operating system and much more","categories":[],"tags":[]},{"title":"Simple web development","slug":"Simple-web-development","date":"2018-06-03T02:20:10.000Z","updated":"2018-06-03T02:40:05.000Z","comments":true,"path":"2018/06/03/Simple-web-development/","link":"","permalink":"blog.whurthay.com/2018/06/03/Simple-web-development/","excerpt":"","text":"How to start - Web developmentCrafting a website doesn’t needs to take ages Web development is a million dollar industry, but it’s one of the simplest art out there to apply,anticipate and bring into existence It is also just not a art. But, also an ecosystem. With possibilites so endless, as the vast oceanof people or atoms or stars or anything in the universe. Web is an ocean If you like to craft thingsYou can start with HTML 123&lt;html&gt;&lt;/html&gt; If you like to keep things prettyYou can grow with CSS12345678&lt;html&gt; &lt;head&gt; &lt;link href=\"app.css\" rel=\"stylesheet\" type=\"text/css\" /&gt; &lt;/head&gt; &lt;body&gt; &lt;div id=\"element\"&gt;&lt;/div&gt; &lt;/body&gt;&lt;/html&gt; 1234//app.css#element &#123; background: whitesmoke;&#125; or, If you are interested in the mechanics of thingsYou can drive with Javascript Once you know all of these, you can make the skeleton.But, to really use these as a method to build an industrial powerhouseHold the Angularjs or Reactjs to name a few or once you know javascript, which is different that Java learn the engineering of the engine with Node.js any other preference of your choice If you are that wild, and just is getting tempted to drive this alreadyJoin the Meteor movement. You won’t regret it It just contains everything you’d need to know, to get started","categories":[],"tags":[]},{"title":"Tracking visitors","slug":"Tracking-visitors","date":"2018-06-03T01:41:19.000Z","updated":"2018-06-03T01:51:26.000Z","comments":true,"path":"2018/06/03/Tracking-visitors/","link":"","permalink":"blog.whurthay.com/2018/06/03/Tracking-visitors/","excerpt":"","text":"Who are theyIt is so simple to understand the concept of trying to understand, why do we need to know, what we know, and how do we need to know, what can be known, once we know Let me ask you something. Why do hotels ask you to check in when you enter a hotel. Why do you need to put all that info, when they can see definitely judge by your appearance, that you are a nice young man/woman. Some might argue, that they don’t want a crooked man, to live at their place. But, Does storing their identiy really hinder crooken men from bypassing the system, once they know it. Storing and tracking visitors to any place, is just what’s been happening from the beginning of time. It’s just been normal, until the internet came into existence. Like sometimes a person from a remote part of the world or a country can enter into and read all sensitive info from a company’s database. Taking no names here (Yahoo, Ebay etc), without them knowing it. Why is it that happens, and what can we do to stop it? Simple, track your visitors, like a CCTV. Get their precise location, their referring sites, time and frequency of visit, everything stored at a finger length distance(use your keyboard). and, Once you really need to identify, who was that person, at that time and that place, and visiting or bombarding bot style visit. You know, where to look, and who to contact. Shhh.. Whurthay It’s that simple, Be Sage, Be Safe visitor Data is power","categories":[],"tags":[]},{"title":"Understanding my users","slug":"Understanding-my-users","date":"2018-06-02T04:27:47.000Z","updated":"2018-06-02T04:53:20.000Z","comments":true,"path":"2018/06/02/Understanding-my-users/","link":"","permalink":"blog.whurthay.com/2018/06/02/Understanding-my-users/","excerpt":"","text":"Germination of the Whurthay movementHi guys,This is Ayush, the sole owner of the whurthay movement. Seems crazy, how is it a movement, when i am the only person in it?Good question. But, to get to that, i would need to tell you a deep story about a quiet programmar. Programmars are of varied kinds as well. As, some of them program to build cool stuff and show it to the whole world. While, some just wants to live in their imagination. That’s just so much, more prettier. I was the second kind. Never liked to go outside and play with my fellow friends, when i was a kid. I personally always loved to stay in my head, all the time. Albert Einstien, used to call these Thought Experiments. He even has been said, to invent an awful lot of theories, just in his head, before putting it on paper. I am no Albert. But, just curious. Curious, that why my brain, just likes it own company. Curious, of why i derive happiness by making sense of everything around me, before i can get comfortable with it. But, i am not here, to tell you guys, about how my brain functions. This story is about, how the idea for Whurthay was born. I was a real sad guy, during my college years, for the first two years. Like, many college students. I wasn’t very much interested, in what my school was teaching, and didn’t even knew, what i was doing with my life, or how collge would help. But, I also had no other choice/way. As, i wasn’t good at anything else, and I wanted to be an engineer, and invent and build something as well. So, i just carried on. But, one day, something strange happened. I stumbled upon the movie, The Social Network. That movie showed me, how a guy from his dorm room, gets everything one desires from life, in a matter of months, if not days. What did he do? He built this cool website, The Facebook. and, he almost had everything come to him. He was just a nerd few months ago, and know body recognized him, like that after this piece of code, was made available to the public. It was fascinating, shocking, all at the same time. I thought to myself, I like building things, and this is what i expected to do, when i joined an engineering college. When i read that Mark left Harvard, after the facebook, was popular. I quickly realised, that i need to do something apart of my college studies, to feel the love of the love of doing, what you love. Yes, you are correct, I started learning PHP and MySQL and what not. Everything with which, the initial version of the Facebook was built. I even helped my sister, built her education company’s website, while still learning how to create a dropdown on the website frontend. It all seamed crazy, but i loved it. I even got over, my fear, that nobody would visit my website, if i ever built one. When, people started to sign up, on my sister’s website. Few minutes, after it was launched. It was all very exhilarating. Now, i have come, a long way, after those early novice stages. But, i did had this inner self wanting to always know, who visited, what i have built. Whenever i built a website, it was always about, who was using it. As, it gave me this feeling of unending influence and love, when some real person, was experiencing what i had to offer(Always use Bot protection) This was how Whurthay germinated. This is how it all started. Hope you guys, enjoy it as much, as i enjoyed building this web visitor tracking &amp; analytics platform. WHURTHAY. Free trial","categories":[],"tags":[]}]}